Revit 2027 API
FabricationServiceButton.IsStraight Property
 Checks if all of the fabrication service button conditions are straights.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsStraight { get; }
Public ReadOnly Property IsStraight As Boolean
	Get
public:
property bool IsStraight {
	bool get ();
}
member IsStraight : bool with get
Property Value
Boolean
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace